A SoulCode Academy utiliza dois sistemas distintos para cadastro de vendas, um em sua matriz e outro em suas filiais.
O sistema da matriz utiliza um db noSQL enquanto os das filiais ainda utilizam um SQL. 
As tabelas a seguir são amostras de dados dos dois tipos de db enviadas para auxiliar seu desenvolvimento. 
Crie uma db em SQL e uma noSQL, e adicione essas amostrar para criar um ambiente simulando o problema real.
A seguir crie um código em Python que leia a db SQL, corrija, padronize e insira os dados na db noSQL.

In [ ]:
#Importando os modulos e os dados do arquivo CSV e salvando em um DataFrame com pandas

In [5]:
import pandas
import pandas as pd

In [9]:
# Leitura de dados e maximizando exibição
df = pd.read_csv("Sistema_A_SQL.csv", sep = ",")
pd.options.display.max_rows = 1000
pd.options.display.max_columns = 3
#df

In [10]:
#Excluindo a coluna nota_fiscal do DataFrame para inserção nos databases
df.drop(['nota_fiscal'], axis=1, inplace=True)

In [11]:
#Exibindo o resultado
#df
df.dtypes
df.head()

     vendedor   total
0  Clarabelle  159.38
1        Berk  144.30
2        Kiri  302.49
3    Brigitta  381.61
4      Barret  277.63

In [19]:
#Conector para o banco SQL
import mysql.connector

mydb = mysql.connector.connect(
  host="ip",
  user="user",
  password="password",
  database="filialA"

)

print("Conectado!", mydb)

Conectado! <mysql.connector.connection.MySQLConnection object at 0x0000022393DD21A0>

In [20]:
#Insere os dados do DataFrame filia_A_SQL no banco de dados SQL - MySQL   
mycursor = mydb.cursor()
for index, row in df.iterrows():
    query=f"INSERT INTO vendas (nome_vendedor, total) VALUES ('{row['vendedor']}', {int(row['total'])})"
    mycursor.execute(query)

In [22]:
# Efetiva a inserção e exibe quantas inserções foram feitas
mydb.commit()

print(mycursor.rowcount, "inserção concluída.")

1 was inserted.

In [6]:
# Leitura de dados e maximizando exibição
df2 = pd.read_csv("Sistema_B_NoSQL.csv", sep = ",")
pd.options.display.max_rows = 1000
pd.options.display.max_columns = 3

In [7]:
#Excluindo a coluna nota_fiscal do DataFrame para inserção nos databases
df2.drop(['nota_fiscal'], axis=1, inplace=True)

In [12]:
#Excluindo as linhas que contem campos vazios para inserção no database
df2 = df2.dropna()
df = df.dropna()

In [1]:
#conector para mongodb
import pymongo
myclient = pymongo.MongoClient("mongodb+srv://user:password@cluster0.4u1yb.mongodb.net/filialb.filialb")
mydb = myclient["filialb"]
mycol = mydb["filialb"]

In [14]:
#inserindo os dados no banco mongo convertendo para dicionarios
data = df2.to_dict(orient = "records")
db = myclient["filialb"]
db.filialb.insert_many(data)

In [15]:
#inserindo os dados do mysql no banco mongo convertendo para dicionarios
data = df.to_dict(orient = "records")
db = myclient["filialb"]
db.filialb.insert_many(data)